app/views/tickets/show.json.jbuilder

SELECT SUM("donations"."amount") AS sum_id FROM "donations"  WHERE "donations"."ticket_id" = 3
---
json.extract! @ticket, :id, :title, :description, :user_id, :project_id, :created_at, :updated_at
json.bounty Donation.where(:ticket_id => @ticket.id).sum :amount