app/controllers/donations_controller.rb

SELECT "donations".* FROM "donations"
---
  def index
    @donations = Donation.all

INSERT INTO "donations" ("amount", "created_at", "ticket_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["amount", 100], ["created_at", "2014-10-09 22:54:28.425357"], ["ticket_id", 2], ["updated_at", "2014-10-09 22:54:28.425357"], ["user_id", 1]]
---
  def create
    @donation = Donation.new(donation_params)

    respond_to do |format|
      if @donation.save

DELETE FROM "donations" WHERE "donations"."id" = ?  [["id", 4]]
---
  def destroy
    @donation.destroy

SELECT  "donations".* FROM "donations"  WHERE "donations"."id" = ? LIMIT 1  [["id", 4]]
---
    def set_donation
      @donation = Donation.find(params[:id])