old/app/controllers/tickets_controller.rb

SELECT "tickets".* FROM "tickets"   ORDER BY "tickets"."created_at" DESC
SELECT "tickets".* FROM "tickets"   ORDER BY "tickets"."bounty" DESC
SELECT "tickets".* FROM "tickets"
---
  def index
    if params[:sort] == 'ascDate'
      @tickets = Ticket.all.order(created_at: :asc)
    elsif params[:sort] == 'descDate'
      @tickets = Ticket.all.order(created_at: :desc)
    # elsif params[:sort] == 'ascBounty'
    #     @tickets = Ticket.all.order(bounty: :asc)
    elsif params[:sort] == 'descBounty'
      @tickets = Ticket.all.order(bounty: :desc)
    else
      @tickets = Ticket.all

INSERT INTO "tickets" ("bounty", "created_at", "description", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["bounty", 1337], ["created_at", "2014-10-09 17:33:50.811232"], ["description", "blah"], ["title", "blah"], ["updated_at", "2014-10-09 17:33:50.811232"], ["user_id", 0]]
---
  def create

    @ticket = Ticket.new(ticket_params)

    respond_to do |format|
      if @ticket.save