old/app/views/tickets/index.json.jbuilder

  json.extract! ticket, :id, :title, :description, :created_at, :project_id
  json.bounty Donation.where(:ticket_id => ticket.id).sum :amount
---
SELECT SUM("donations"."amount") AS sum_id FROM "donations"  WHERE "donations"."ticket_id" = 2