old/app/views/tickets/index.html.erb

        <td><%= ticket.project.name %></td>
        <td><%= Donation.where(:ticket_id => ticket.id).sum :amount %></td>
---
SELECT SUM("donations"."amount") AS sum_id FROM "donations"  WHERE "donations"."ticket_id" = 1